hysonglet/py32-pacs/svds/py32c611xx.svd
			</registers>
		</peripheral>
		<peripheral>
				<name>IWDG</name>
				<description>Independent watchdog</description>
				<groupName>IWDG</groupName>
				<baseAddress>0x40003000</baseAddress>
				<addressBlock>
					<offset>0x0</offset>
					<size>0x400</size>
					<usage>registers</usage>
				</addressBlock>
				<registers>
					<register>
						<name>KR</name>
						<displayName>KR</displayName>
						<description>Key register (IWDG_KR)</description>
						<addressOffset>0x0</addressOffset>
						<size>0x20</size>
						<access>write-only</access>
						<resetValue>0x00000000</resetValue>
						<fields>
							<field>
								<name>KEY</name>
								<description>Key value</description>
								<bitOffset>0</bitOffset>
								<bitWidth>16</bitWidth>
							</field>
						</fields>
					</register>
					<register>
						<name>PR</name>
						<displayName>PR</displayName>
						<description>Prescaler register (IWDG_PR)</description>
						<addressOffset>0x4</addressOffset>
						<size>0x20</size>
						<access>read-write</access>
						<resetValue>0x00000000</resetValue>
						<fields>
							<field>
								<name>PR</name>
								<description>Prescaler divider</description>
								<bitOffset>0</bitOffset>
								<bitWidth>3</bitWidth>
							</field>
						</fields>
					</register>
					<register>
						<name>RLR</name>
						<displayName>RLR</displayName>
						<description>Reload register (IWDG_RLR)</description>
						<addressOffset>0x8</addressOffset>
						<size>0x20</size>
						<access>read-write</access>
						<resetValue>0x00000FFF</resetValue>
						<fields>
							<field>
								<name>RL</name>
								<description>Watchdog counter reload
								value</description>
								<bitOffset>0</bitOffset>
								<bitWidth>12</bitWidth>
							</field>
						</fields>
					</register>
					<register>
						<name>SR</name>
						<displayName>SR</displayName>
						<description>Status register (IWDG_SR)</description>
						<addressOffset>0xC</addressOffset>
						<size>0x20</size>
						<access>read-only</access>
						<resetValue>0x00000000</resetValue>
						<fields>
							<field>
								<name>WVU</name>
								<description>Watchdog counter window value update</description>
								<bitOffset>2</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>RVU</name>
								<description>Watchdog counter reload value
								update</description>
								<bitOffset>1</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>PVU</name>
								<description>Watchdog prescaler value
								update</description>
								<bitOffset>0</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
						</fields>
					</register>
					<register>
						<name>WINR</name>
						<displayName>WINR</displayName>
						<description>Window register (IWDG_SR)</description>
						<addressOffset>0x10</addressOffset>
						<size>0x20</size>
						<access>read-only</access>
						<resetValue>0x00000000</resetValue>
						<fields>
							<field>
								<name>WIN</name>
								<description>window counter</description>
								<bitOffset>0</bitOffset>
								<bitWidth>12</bitWidth>
							</field>
						</fields>
					</register>			
				</registers>
		</peripheral>
		<peripheral>
				<name>WWDG</name>
				<description>Window watchdog</description>
				<groupName>WWDG</groupName>
				<baseAddress>0x40002C00</baseAddress>
				<addressBlock>
					<offset>0x0</offset>
					<size>0x400</size>
					<usage>registers</usage>
				</addressBlock>
				<interrupt>
					<name>WWDG</name>
					<description>Window WatchDog Interrupt</description>
					<value>0</value>
				</interrupt>
				<registers>
					<register>
						<name>CR</name>
						<displayName>CR</displayName>
						<description>Control register (WWDG_CR)</description>
						<addressOffset>0x0</addressOffset>
						<size>0x20</size>
						<access>read-write</access>
						<resetValue>0x0000007F</resetValue>
						<fields>
							<field>
								<name>WDGA</name>
								<description>Activation bit</description>
								<bitOffset>7</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>T</name>
								<description>7-bit counter (MSB to LSB)</description>
								<bitOffset>0</bitOffset>
								<bitWidth>7</bitWidth>
							</field>
						</fields>
					</register>
					<register>
						<name>CFR</name>
						<displayName>CFR</displayName>
						<description>Configuration register
						(WWDG_CFR)</description>
						<addressOffset>0x4</addressOffset>
						<size>0x20</size>
						<access>read-write</access>
						<resetValue>0x0000007F</resetValue>
						<fields>
							<field>
								<name>EWI</name>
								<description>Early Wakeup Interrupt</description>
								<bitOffset>9</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>WDGTB</name>
								<description>Timer Base</description>
								<bitOffset>7</bitOffset>
								<bitWidth>2</bitWidth>
							</field>
							<field>
								<name>W</name>
								<description>7-bit window value</description>
								<bitOffset>0</bitOffset>
								<bitWidth>7</bitWidth>
							</field>
						</fields>
					</register>
					<register>
						<name>SR</name>
						<displayName>SR</displayName>
						<description>Status register (WWDG_SR)</description>
						<addressOffset>0x8</addressOffset>
						<size>0x20</size>
						<access>read-write</access>
						<resetValue>0x00000000</resetValue>
						<fields>
							<field>
								<name>EWIF</name>
								<description>Early Wakeup Interrupt flag</description>
								<bitOffset>0</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
						</fields>
					</register>
				</registers>
		</peripheral>
		<peripheral>
				<name>TIM1</name>
				<description>Advanced timer</description>
				<groupName>TIM</groupName>
				<baseAddress>0x40012C00</baseAddress>
				<addressBlock>
					<offset>0x0</offset>
					<size>0x400</size>
					<usage>registers</usage>
				</addressBlock>
				<interrupt>
					<name>TIM1_BRK_UP_TRG_COM</name>
					<description>TIM1 Break, Update, Trigger and Commutation Interrupt</description>
					<value>13</value>
				</interrupt>
				<interrupt>
					<name>TIM1_CC</name>
					<description>TIM1 Capture Compare Interrupt</description>
					<value>14</value>
				</interrupt>
				<registers>
					<register>
						<name>CR1</name>
						<displayName>CR1</displayName>
						<description>control register 1</description>
						<addressOffset>0x0</addressOffset>
						<size>0x20</size>
						<access>read-write</access>
						<resetValue>0x0000</resetValue>
						<fields>
							<field>
								<name>CKD</name>
								<description>Clock division</description>
								<bitOffset>8</bitOffset>
								<bitWidth>2</bitWidth>
							</field>
							<field>
								<name>ARPE</name>
								<description>Auto-reload preload enable</description>
								<bitOffset>7</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>CMS</name>
								<description>Center-aligned mode
								selection</description>
								<bitOffset>5</bitOffset>
								<bitWidth>2</bitWidth>
							</field>
							<field>
								<name>DIR</name>
								<description>Direction</description>
								<bitOffset>4</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>OPM</name>
								<description>One-pulse mode</description>
								<bitOffset>3</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>URS</name>
								<description>Update request source</description>
								<bitOffset>2</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>UDIS</name>
								<description>Update disable</description>
								<bitOffset>1</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>CEN</name>
								<description>Counter enable</description>
								<bitOffset>0</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
						</fields>
					</register>
					<register>
						<name>CR2</name>
						<displayName>CR2</displayName>
						<description>control register 2</description>
						<addressOffset>0x4</addressOffset>
						<size>0x20</size>
						<access>read-write</access>
						<resetValue>0x0000</resetValue>
						<fields>
							<field>
								<name>OIS4</name>
								<description>Output Idle state 4</description>
								<bitOffset>14</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>OIS3N</name>
								<description>Output Idle state 3</description>
								<bitOffset>13</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>OIS3</name>
								<description>Output Idle state 3</description>
								<bitOffset>12</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>OIS2N</name>
								<description>Output Idle state 2</description>
								<bitOffset>11</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>OIS2</name>
								<description>Output Idle state 2</description>
								<bitOffset>10</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>OIS1N</name>
								<description>Output Idle state 1</description>
								<bitOffset>9</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>OIS1</name>
								<description>Output Idle state 1</description>
								<bitOffset>8</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>TI1S</name>
								<description>TI1 selection</description>
								<bitOffset>7</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>MMS</name>
								<description>Master mode selection</description>
								<bitOffset>4</bitOffset>
								<bitWidth>3</bitWidth>
							</field>
							<field>
								<name>CCDS</name>
								<description>Capture/compare DMA
								selection</description>
								<bitOffset>3</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>CCUS</name>
								<description>Capture/compare control update
								selection</description>
								<bitOffset>2</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>CCPC</name>
								<description>Capture/compare preloaded
								control</description>
								<bitOffset>0</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
						</fields>
					</register>
					<register>
						<name>SMCR</name>
						<displayName>SMCR</displayName>
						<description>slave mode control register</description>
						<addressOffset>0x8</addressOffset>
						<size>0x20</size>
						<access>read-write</access>
						<resetValue>0x0000</resetValue>
						<fields>
							<field>
								<name>ETP</name>
								<description>External trigger polarity</description>
								<bitOffset>15</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>ECE</name>
								<description>External clock enable</description>
								<bitOffset>14</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>ETPS</name>
								<description>External trigger prescaler</description>
								<bitOffset>12</bitOffset>
								<bitWidth>2</bitWidth>
							</field>
							<field>
								<name>ETF</name>
								<description>External trigger filter</description>
								<bitOffset>8</bitOffset>
								<bitWidth>4</bitWidth>
							</field>
							<field>
								<name>MSM</name>
								<description>Master/Slave mode</description>
								<bitOffset>7</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>TS</name>
								<description>Trigger selection</description>
								<bitOffset>4</bitOffset>
								<bitWidth>3</bitWidth>
							</field>
							<field>
								<name>OCCS</name>
								<description>OCREF clear selection bit</description>
								<bitOffset>3</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>SMS</name>
								<description>Slave mode selection</description>
								<bitOffset>0</bitOffset>
								<bitWidth>3</bitWidth>
							</field>
						</fields>
					</register>
					<register>
						<name>DIER</name>
						<displayName>DIER</displayName>
						<description>DMA/Interrupt enable register</description>
						<addressOffset>0xC</addressOffset>
						<size>0x20</size>
						<access>read-write</access>
						<resetValue>0x0000</resetValue>
						<fields>
							<field>
								<name>TDE</name>
								<description>Trigger DMA request enable</description>
								<bitOffset>14</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>COMDE</name>
								<description>COM DMA request enable</description>
								<bitOffset>13</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>CC4DE</name>
								<description>Capture/Compare 4 DMA request
								enable</description>
								<bitOffset>12</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>CC3DE</name>
								<description>Capture/Compare 3 DMA request
								enable</description>
								<bitOffset>11</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>CC2DE</name>
								<description>Capture/Compare 2 DMA request
								enable</description>
								<bitOffset>10</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>CC1DE</name>
								<description>Capture/Compare 1 DMA request
								enable</description>
								<bitOffset>9</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>UDE</name>
								<description>Update DMA request enable</description>
								<bitOffset>8</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>BIE</name>
								<description>Break interrupt enable</description>
								<bitOffset>7</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>TIE</name>
								<description>Trigger interrupt enable</description>
								<bitOffset>6</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>COMIE</name>
								<description>COM interrupt enable</description>
								<bitOffset>5</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>CC4IE</name>
								<description>Capture/Compare 4 interrupt
								enable</description>
								<bitOffset>4</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>CC3IE</name>
								<description>Capture/Compare 3 interrupt
								enable</description>
								<bitOffset>3</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>CC2IE</name>
								<description>Capture/Compare 2 interrupt
								enable</description>
								<bitOffset>2</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>CC1IE</name>
								<description>Capture/Compare 1 interrupt
								enable</description>
								<bitOffset>1</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>UIE</name>
								<description>Update interrupt enable</description>
								<bitOffset>0</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
						</fields>
					</register>
					<register>
						<name>SR</name>
						<displayName>SR</displayName>
						<description>status register</description>
						<addressOffset>0x10</addressOffset>
						<size>0x20</size>
						<access>read-write</access>
						<resetValue>0x0000</resetValue>
						<fields>
							<field>
								<name>CC4OF</name>
								<description>Capture/Compare 4 overcapture
								flag</description>
								<bitOffset>12</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>CC3OF</name>
								<description>Capture/Compare 3 overcapture
								flag</description>
								<bitOffset>11</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>CC2OF</name>
								<description>Capture/compare 2 overcapture
								flag</description>
								<bitOffset>10</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>CC1OF</name>
								<description>Capture/Compare 1 overcapture
								flag</description>
								<bitOffset>9</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>BIF</name>
								<description>Break interrupt flag</description>
								<bitOffset>7</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>TIF</name>
								<description>Trigger interrupt flag</description>
								<bitOffset>6</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>COMIF</name>
								<description>COM interrupt flag</description>
								<bitOffset>5</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>CC4IF</name>
								<description>Capture/Compare 4 interrupt
								flag</description>
								<bitOffset>4</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>CC3IF</name>
								<description>Capture/Compare 3 interrupt
								flag</description>
								<bitOffset>3</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>CC2IF</name>
								<description>Capture/Compare 2 interrupt
								flag</description>
								<bitOffset>2</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>CC1IF</name>
								<description>Capture/compare 1 interrupt
								flag</description>
								<bitOffset>1</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>UIF</name>
								<description>Update interrupt flag</description>
								<bitOffset>0</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
						</fields>
					</register>
					<register>
						<name>EGR</name>
						<displayName>EGR</displayName>
						<description>event generation register</description>
						<addressOffset>0x14</addressOffset>
						<size>0x20</size>
						<access>write-only</access>
						<resetValue>0x0000</resetValue>
						<fields>
							<field>
								<name>BG</name>
								<description>Break generation</description>
								<bitOffset>7</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>TG</name>
								<description>Trigger generation</description>
								<bitOffset>6</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>COMG</name>
								<description>Capture/Compare control update
								generation</description>
								<bitOffset>5</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>CC4G</name>
								<description>Capture/compare 4
								generation</description>
								<bitOffset>4</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>CC3G</name>
								<description>Capture/compare 3
								generation</description>
								<bitOffset>3</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>CC2G</name>
								<description>Capture/compare 2
								generation</description>
								<bitOffset>2</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>CC1G</name>
								<description>Capture/compare 1
								generation</description>
								<bitOffset>1</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>UG</name>
								<description>Update generation</description>
								<bitOffset>0</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
						</fields>
					</register>
					<register>
						<name>CCMR1_Output</name>
						<displayName>CCMR1_Output</displayName>
						<description>capture/compare mode register (output
						mode)</description>
						<addressOffset>0x18</addressOffset>
						<size>0x20</size>
						<access>read-write</access>
						<resetValue>0x00000000</resetValue>
						<fields>
							<field>
								<name>OC2CE</name>
								<description>Output Compare 2 clear
								enable</description>
								<bitOffset>15</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>OC2M</name>
								<description>Output Compare 2 mode</description>
								<bitOffset>12</bitOffset>
								<bitWidth>3</bitWidth>
							</field>
							<field>
								<name>OC2PE</name>
								<description>Output Compare 2 preload
								enable</description>
								<bitOffset>11</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>OC2FE</name>
								<description>Output Compare 2 fast
								enable</description>
								<bitOffset>10</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>CC2S</name>
								<description>Capture/Compare 2
								selection</description>
								<bitOffset>8</bitOffset>
								<bitWidth>2</bitWidth>
							</field>
							<field>
								<name>OC1CE</name>
								<description>Output Compare 1 clear
								enable</description>
								<bitOffset>7</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>OC1M</name>
								<description>Output Compare 1 mode</description>
								<bitOffset>4</bitOffset>
								<bitWidth>3</bitWidth>
							</field>
							<field>
								<name>OC1PE</name>
								<description>Output Compare 1 preload
								enable</description>
								<bitOffset>3</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>OC1FE</name>
								<description>Output Compare 1 fast
								enable</description>
								<bitOffset>2</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>CC1S</name>
								<description>Capture/Compare 1
								selection</description>
								<bitOffset>0</bitOffset>
								<bitWidth>2</bitWidth>
							</field>
						</fields>
					</register>
