hysonglet/py32-pacs/svds/py32c611xx.svd
				</registers>
		</peripheral>
		<peripheral>
				<name>TIM16</name>
				<description>General purpose timer</description>
				<groupName>TIM</groupName>
				<baseAddress>0x40014400</baseAddress>
				<addressBlock>
					<offset>0x00</offset>
					<size>0x400</size>
					<usage>registers</usage>
				</addressBlock>
				<interrupt>
					<name>TIM16</name>
					<description>TIM16 global Interrupt</description>
					<value>21</value>
				</interrupt>
				<registers>
					<register>
						<name>CR1</name>
						<displayName>CR1</displayName>
						<description>TIM16 control register1</description>
						<addressOffset>0x0</addressOffset>
						<size>0x20</size>
						<access>read-write</access>
						<resetValue>0x0000</resetValue>
						<fields>
							<field>
								<name>CKD</name>
								<description>Prescaler factor</description>
								<bitOffset>8</bitOffset>
								<bitWidth>2</bitWidth>
							</field>
							<field>
								<name>ARPE</name>
								<description>Auto-reload preload enable</description>
								<bitOffset>7</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>OPM</name>
								<description>One pulse mode</description>
								<bitOffset>3</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>URS</name>
								<description>Update request source</description>
								<bitOffset>2</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>UDIS</name>
								<description>Update disable</description>
								<bitOffset>1</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>CEN</name>
								<description>Counter enable</description>
								<bitOffset>0</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
						</fields>
					</register>
					<register>
						<name>CR2</name>
						<displayName>CR2</displayName>
						<description>control register 2</description>
						<addressOffset>0x4</addressOffset>
						<size>0x20</size>
						<access>read-write</access>
						<resetValue>0x0000</resetValue>
						<fields>
							<field>
								<name>OIS1N</name>
								<description>Output Idle state 1</description>
								<bitOffset>9</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>OIS1</name>
								<description>Output Idle state 1</description>
								<bitOffset>8</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>CCDS</name>
								<description>Capture/compare DMA
								selection</description>
								<bitOffset>3</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>CCPC</name>
								<description>Capture/compare preloaded
								control</description>
								<bitOffset>0</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
						</fields>
					</register>
					<register>
						<name>DIER</name>
						<displayName>DIER</displayName>
						<description>DMA/Interrupt enable register</description>
						<addressOffset>0xC</addressOffset>
						<size>0x20</size>
						<access>read-write</access>
						<resetValue>0x0000</resetValue>
						<fields>
							<field>
								<name>CC1DE</name>
								<description>Compare/capture DMA requeset enable</description>
								<bitOffset>9</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>UDE</name>
								<description>Update DMA request enable </description>
								<bitOffset>8</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>BIE</name>
								<description>Break interrupt enable</description>
								<bitOffset>7</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>COMIE</name>
								<description>Com interrupt enable</description>
								<bitOffset>5</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>CC1IE</name>
								<description>Capture/Compare 1 interrupt enable</description>
								<bitOffset>1</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>UIE</name>
								<description>Update interrupt enable</description>
								<bitOffset>0</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
						</fields>
					</register>
					<register>
						<name>SR</name>
						<displayName>SR</displayName>
						<description>status register</description>
						<addressOffset>0x10</addressOffset>
						<size>0x20</size>
						<access>read-write</access>
						<resetValue>0x0000</resetValue>
						<fields>
							<field>
								<name>CC1OF</name>
								<description>Update interrupt flag</description>
								<bitOffset>9</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>BIF</name>
								<description>Break interrupt flag</description>
								<bitOffset>7</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>COMIF</name>
								<description>Com interrupt flag</description>
								<bitOffset>5</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>CC1IF</name>
								<description>Capture/Compare 1 interrupt flag</description>
								<bitOffset>1</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>UIF</name>
								<description>Update interrupt flag</description>
								<bitOffset>0</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
						</fields>
					</register>
					<register>
						<name>EGR</name>
						<displayName>EGR</displayName>
						<description>event generation register</description>
						<addressOffset>0x14</addressOffset>
						<size>0x20</size>
						<access>write-only</access>
						<resetValue>0x0000</resetValue>
						<fields>
							<field>
								<name>BG</name>
								<description>Break event generation</description>
								<bitOffset>7</bitOffset>
								<bitWidth>1</bitWidth>
							</field>							
							<field>
								<name>COMG</name>
								<description>COM evnet generation</description>
								<bitOffset>5</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>CC1G</name>
								<description>Capture/Compare 1 generation</description>
								<bitOffset>1</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>UG</name>
								<description>Update generation</description>
								<bitOffset>0</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
						</fields>
					</register>
					<register>
						<name>CCMR1_Output</name>
						<displayName>CCMR1_Output</displayName>
						<description>capture/compare mode register (output
						mode)</description>
						<addressOffset>0x18</addressOffset>
						<size>0x20</size>
						<access>read-write</access>
						<resetValue>0x00000000</resetValue>
						<fields>
							<field>
								<name>OC1M</name>
								<description>Output Compare 1 mode</description>
								<bitOffset>4</bitOffset>
								<bitWidth>3</bitWidth>
							</field>
							<field>
								<name>OC1PE</name>
								<description>Output Compare 1 preload
								enable</description>
								<bitOffset>3</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>OC1FE</name>
								<description>Output Compare 1 fast
								enable</description>
								<bitOffset>2</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>CC1S</name>
								<description>Capture/Compare 1
								selection</description>
								<bitOffset>0</bitOffset>
								<bitWidth>2</bitWidth>
							</field>
						</fields>
					</register>
					<register>
						<name>CCMR1_Input</name>
						<displayName>CCMR1_Input</displayName>
						<description>capture/compare mode register 1 (input
						mode)</description>
						<alternateRegister>CCMR1_Output</alternateRegister>
						<addressOffset>0x18</addressOffset>
						<size>0x20</size>
						<access>read-write</access>
						<resetValue>0x00000000</resetValue>
						<fields>
							<field>
								<name>IC1F</name>
								<description>Input capture 1 filter</description>
								<bitOffset>4</bitOffset>
								<bitWidth>4</bitWidth>
							</field>
							<field>
								<name>IC1PSC</name>
								<description>Input capture 1 prescaler</description>
								<bitOffset>2</bitOffset>
								<bitWidth>2</bitWidth>
							</field>
							<field>
								<name>CC1S</name>
								<description>Capture/Compare 1
								selection</description>
								<bitOffset>0</bitOffset>
								<bitWidth>2</bitWidth>
							</field>
						</fields>
					</register>
					<register>
						<name>CCER</name>
						<displayName>CCER</displayName>
						<description>capture/compare enable
						register</description>
						<addressOffset>0x20</addressOffset>
						<size>0x20</size>
						<access>read-write</access>
						<resetValue>0x0000</resetValue>
						<fields>
							<field>
								<name>CC1NP</name>
								<description>Capture/Compare 1 output
								Polarity</description>
								<bitOffset>3</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>CC1NE</name>
								<description>Capture/Compare 1 complementary output
								enable</description>
								<bitOffset>2</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>CC1P</name>
								<description>Capture/Compare 1 output
								Polarity</description>
								<bitOffset>1</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>CC1E</name>
								<description>Capture/Compare 1 output
								enable</description>
								<bitOffset>0</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
						</fields>
					</register>
					<register>
						<name>CNT</name>
						<displayName>CNT</displayName>
						<description>counter</description>
						<addressOffset>0x24</addressOffset>
						<size>0x20</size>
						<access>read-write</access>
						<resetValue>0x00000000</resetValue>
						<fields>
							<field>
								<name>CNT</name>
								<description>counter value</description>
								<bitOffset>0</bitOffset>
								<bitWidth>16</bitWidth>
							</field>
						</fields>
					</register>
					<register>
						<name>PSC</name>
						<displayName>PSC</displayName>
						<description>prescaler</description>
						<addressOffset>0x28</addressOffset>
						<size>0x20</size>
						<access>read-write</access>
						<resetValue>0x0000</resetValue>
						<fields>
							<field>
								<name>PSC</name>
								<description>Prescaler value</description>
								<bitOffset>0</bitOffset>
								<bitWidth>16</bitWidth>
							</field>
						</fields>
					</register>
					<register>
						<name>ARR</name>
						<displayName>ARR</displayName>
						<description>auto-reload register</description>
						<addressOffset>0x2C</addressOffset>
						<size>0x20</size>
						<access>read-write</access>
						<resetValue>0x00000000</resetValue>
						<fields>
							<field>
								<name>ARR</name>
								<description>Auto-reload value</description>
								<bitOffset>0</bitOffset>
								<bitWidth>16</bitWidth>
							</field>
						</fields>
					</register>
					<register>
						<name>RCR</name>
						<displayName>RCR</displayName>
						<description>repetition counter register</description>
						<addressOffset>0x30</addressOffset>
						<size>0x20</size>
						<access>read-write</access>
						<resetValue>0x0000</resetValue>
						<fields>
							<field>
								<name>REP</name>
								<description>Repetition counter value</description>
								<bitOffset>0</bitOffset>
								<bitWidth>8</bitWidth>
							</field>
						</fields>
					</register>
					<register>
						<name>CCR1</name>
						<displayName>CCR1</displayName>
						<description>capture/compare register 1</description>
						<addressOffset>0x34</addressOffset>
						<size>0x20</size>
						<access>read-write</access>
						<resetValue>0x00000000</resetValue>
						<fields>
							<field>
								<name>CCR1</name>
								<description>Capture/Compare 1 value</description>
								<bitOffset>0</bitOffset>
								<bitWidth>16</bitWidth>
							</field>
						</fields>
					</register>
					<register>
						<name>BDTR</name>
						<displayName>BDTR</displayName>
						<description>break and dead-time register</description>
						<addressOffset>0x44</addressOffset>
						<size>0x20</size>
						<access>read-write</access>
						<resetValue>0x0000</resetValue>
						<fields>
							<field>
								<name>MOE</name>
								<description>Main output enable</description>
								<bitOffset>15</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>AOE</name>
								<description>Automatic output enable</description>
								<bitOffset>14</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>BKP</name>
								<description>Break polarity</description>
								<bitOffset>13</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>BKE</name>
								<description>Break enable</description>
								<bitOffset>12</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>OSSR</name>
								<description>Off-state selection for Run
								mode</description>
								<bitOffset>11</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>OSSI</name>
								<description>Off-state selection for Idle
								mode</description>
								<bitOffset>10</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>LOCK</name>
								<description>Lock configuration</description>
								<bitOffset>8</bitOffset>
								<bitWidth>2</bitWidth>
							</field>
							<field>
								<name>DTG</name>
								<description>Dead-time generator setup</description>
								<bitOffset>0</bitOffset>
								<bitWidth>8</bitWidth>
							</field>
						</fields>
					</register>
					<register>
						<name>DCR</name>
						<displayName>DCR</displayName>
						<description>DMA control register</description>
						<addressOffset>0x48</addressOffset>
						<size>0x20</size>
						<access>read-write</access>
						<resetValue>0x0000</resetValue>
						<fields>
							<field>
								<name>DBL</name>
								<description>DMA burst length</description>
								<bitOffset>8</bitOffset>
								<bitWidth>5</bitWidth>
							</field>
							<field>
								<name>DBA</name>
								<description>DMA base address</description>
								<bitOffset>0</bitOffset>
								<bitWidth>5</bitWidth>
							</field>
						</fields>
					</register>
					<register>
						<name>DMAR</name>
						<displayName>DMAR</displayName>
						<description>DMA address for full transfer</description>
						<addressOffset>0x4C</addressOffset>
						<size>0x20</size>
						<access>read-write</access>
						<resetValue>0x0000</resetValue>
						<fields>
							<field>
								<name>DMAB</name>
								<description>DMA register for burst
								accesses</description>
								<bitOffset>0</bitOffset>
								<bitWidth>32</bitWidth>
							</field>
						</fields>
					</register>
